# GetValueAsDoubles Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray4d..::..GetValueAsDoubles Method
AssetPropertyDoubleArray4d Class See Also
---
Gets the value property as doubles.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<double> GetValueAsDoubles()
```

Visual Basic
---
```text
Public Function GetValueAsDoubles As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetValueAsDoubles()
```

# ### Return Value
The value as doubles.
# See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace